Repository: NicolaLS/payment-app
Catalog: apps/lasr/feature/onboarding/src/iosMain/resources/LasrOnboarding.xcstrings
Source language: en
Languages: de, es

# onboarding_add_wallet_intro
source: You'll create a connection in your wallet and bring the connection string back to Lasr.
de: Du erstellst eine Verbindung in deiner Wallet und bringst den Verbindungs-String zurück zu Lasr.
es: Crearás una conexión en tu billetera y traerás la cadena de conexión a Lasr.

# onboarding_add_wallet_step1
source: In your wallet, create a new NWC connection for Lasr.
de: Erstelle in deiner Wallet eine neue NWC-Verbindung für Lasr.
es: En tu billetera, crea una nueva conexión NWC para Lasr.

# onboarding_add_wallet_step2
source: Set a reasonable budget and enable payment permissions.
de: Setze ein vernünftiges Budget und aktiviere Zahlungsberechtigungen.
es: Establece un presupuesto razonable y habilita los permisos de pago.

# onboarding_add_wallet_step3
source: Scan the QR code or paste the connection string on the next screen.
de: Scanne den QR-Code oder füge den Verbindungs-String auf dem nächsten Bildschirm ein.
es: Escanea el código QR o pega la cadena de conexión en la siguiente pantalla.

# onboarding_add_wallet_title
source: Connect via NWC
de: Per NWC verbinden
es: Conectar vía NWC

# onboarding_agreement_body
source: Using Lasr is at your own risk. This app connects to your own Lightning wallet - you are fully responsible for the funds in your wallet and any payments made. We strongly recommend connecting wallets with small spending balances or using NWC connections with limited budgets.
de: Die Nutzung von Lasr erfolgt auf eigenes Risiko. Diese App verbindet sich mit deiner eigenen Lightning-Wallet – du bist vollständig verantwortlich für die Gelder in deiner Wallet und alle getätigten Zahlungen. Wir empfehlen dringend, Wallets mit kleinem Guthaben zu verbinden oder NWC-Verbindungen mit begrenztem Budget zu nutzen.
es: Usar Lasr es bajo tu propio riesgo. Esta app se conecta a tu propia billetera Lightning – eres totalmente responsable de los fondos en tu billetera y de cualquier pago realizado. Recomendamos encarecidamente conectar billeteras con saldos pequeños o usar conexiones NWC con presupuestos limitados.

# onboarding_autopay_body
source: Choose when Lasr should ask for confirmation before paying.
de: Wähle aus, wann Lasr vor einer Zahlung um Bestätigung bitten soll.
es: Elige cuándo Lasr debe pedir confirmación antes de pagar.

# onboarding_features_page1_body
source: Lasr scans in the background so checkout stays smooth. Aim at the code, wait a beat, and you're good.
de: Lasr scannt im Hintergrund für einen reibungslosen Checkout. Richte auf den Code, warte kurz, fertig.
es: Lasr escanea en segundo plano para un pago fluido. Apunta al código, espera un momento y listo.

# onboarding_features_page1_subtitle
source: It's working - even if you can't see the camera.
de: Es funktioniert – auch wenn du die Kamera nicht siehst.
es: Está funcionando – aunque no veas la cámara.

# onboarding_features_page1_title
source: Quiet scanner, quick results
de: Leiser Scanner, schnelle Ergebnisse
es: Escáner silencioso, resultados rápidos

# onboarding_features_page2_body
source: Set a limit you're comfortable with. For anything above it, Lasr will ask before paying.
de: Lege ein Limit fest, mit dem du dich wohl fühlst. Für alles darüber fragt Lasr vor der Zahlung nach.
es: Establece un límite con el que te sientas cómodo. Para cualquier monto superior, Lasr preguntará antes de pagar.

# onboarding_features_page2_subtitle
source: Pay small amounts instantly - no extra taps.
de: Kleine Beträge sofort bezahlen – ohne zusätzliche Taps.
es: Paga montos pequeños al instante – sin toques adicionales.

# onboarding_features_page2_title
source: Auto Pay, your rules
de: Auto Pay, deine Regeln
es: Auto Pay, tus reglas

# onboarding_features_page3_body
source: Connect the wallet you already use. Lasr focuses on fast in-person payments - everything else stays in your wallet.
de: Verbinde die Wallet, die du bereits nutzt. Lasr konzentriert sich auf schnelle Zahlungen vor Ort – alles andere bleibt in deiner Wallet.
es: Conecta la billetera que ya usas. Lasr se enfoca en pagos rápidos en persona – todo lo demás permanece en tu billetera.

# onboarding_features_page3_subtitle
source: Lasr is the checkout shortcut.
de: Lasr ist nur die Checkout-Abkürzung.
es: Lasr es solo el atajo para pagar.

# onboarding_features_page3_title
source: Your wallet stays your wallet
de: Deine Wallet bleibt deine Wallet
es: Tu billetera sigue siendo tu billetera

# onboarding_welcome_subtitle_line1
source: by Bitcoin Coast
de: von Bitcoin Coast
es: por Bitcoin Coast

# onboarding_welcome_subtitle_line2
source: The quickest way to take payments with the wallet you already use.
de: Der schnellste Weg, Zahlungen mit deiner vorhandenen Wallet zu empfangen.
es: La forma más rápida de recibir pagos con la billetera que ya usas.

# onboarding_welcome_title
source: Welcome to Lasr
de: Willkommen bei Lasr
es: Bienvenido a Lasr
